In [159]:
import pandas as pd

In [160]:
#Check version
pd.__version__

'0.24.2'

In [161]:
#Import state population, area, and abbreviation data.
pop = pd.read_csv('state-population.csv')
areas = pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')

In [162]:
#Display a segment of the population data.
print(pop.head());

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [163]:
#Display a segment of the state area data.
print(areas.head());

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [164]:
#Display the state abbreviation.
print(abbrevs.head());

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [165]:
#Verify that only the 50 U.S. states are listed in the population dataframe.
pop['state/region'].unique()

array(['AL', 'AK', 'AZ', 'AR', 'CA', 'CO', 'CT', 'DE', 'DC', 'FL', 'GA',
       'HI', 'ID', 'IL', 'IN', 'IA', 'KS', 'KY', 'LA', 'ME', 'MD', 'MA',
       'MI', 'MN', 'MS', 'MO', 'MT', 'NE', 'NV', 'NH', 'NJ', 'NM', 'NY',
       'NC', 'ND', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 'SD', 'TN', 'TX',
       'UT', 'VT', 'VA', 'WA', 'WV', 'WI', 'WY', 'PR', 'USA'],
      dtype=object)

In [166]:
#Remove non-state data...USA, DC, and Puerto Rico.
pop = pop[pop['state/region']  != 'USA']
pop = pop[pop['state/region']  != 'DC']
pop = pop[pop['state/region']  != 'PR']

In [167]:
#Check the table for null values.
pop.isna().any()

state/region    False
ages            False
year            False
population      False
dtype: bool

In [168]:
##Verify that only the 50 U.S. states are listed in the areas dataframe.
areas['state'].unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'Florida', 'Georgia',
       'Hawaii', 'Idaho', 'Illinois', 'Indiana', 'Iowa', 'Kansas',
       'Kentucky', 'Louisiana', 'Maine', 'Maryland', 'Massachusetts',
       'Michigan', 'Minnesota', 'Mississippi', 'Missouri', 'Montana',
       'Nebraska', 'Nevada', 'New Hampshire', 'New Jersey', 'New Mexico',
       'New York', 'North Carolina', 'North Dakota', 'Ohio', 'Oklahoma',
       'Oregon', 'Pennsylvania', 'Rhode Island', 'South Carolina',
       'South Dakota', 'Tennessee', 'Texas', 'Utah', 'Vermont',
       'Virginia', 'Washington', 'West Virginia', 'Wisconsin', 'Wyoming',
       'District of Columbia', 'Puerto Rico'], dtype=object)

In [169]:
#Remove non-state data...USA, DC, and Puerto Rico.
areas = areas[areas['state']  != 'Puerto Rico']
areas = areas[areas['state']  != 'District of Columbia']

In [170]:
#Check the table for null values.
areas.isna().any()

state            False
area (sq. mi)    False
dtype: bool

In [171]:
##Verify that only the 50 U.S. states are listed in the abbreviations dataframe.
abbrevs['state'].unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Montana',
       'Nebraska', 'Nevada', 'New Hampshire', 'New Jersey', 'New Mexico',
       'New York', 'North Carolina', 'North Dakota', 'Ohio', 'Oklahoma',
       'Oregon', 'Maryland', 'Massachusetts', 'Michigan', 'Minnesota',
       'Mississippi', 'Missouri', 'Pennsylvania', 'Rhode Island',
       'South Carolina', 'South Dakota', 'Tennessee', 'Texas', 'Utah',
       'Vermont', 'Virginia', 'Washington', 'West Virginia', 'Wisconsin',
       'Wyoming'], dtype=object)

In [172]:
#Remove non-state data...USA, DC, and Puerto Rico.
abbrevs = abbrevs[abbrevs['state']  != 'District of Columbia']

In [173]:
#Check the table for null values.
abbrevs.isna().any()

state           False
abbreviation    False
dtype: bool

In [174]:
#Merge the abbreviations table with the population table.
merged = pd.merge(pop, abbrevs, how = 'outer',
                 left_on = 'state/region', right_on = 'abbreviation')

In [175]:
#Remove the redundant table.
merged = merged.drop('abbreviation', 1)

In [176]:
#View a snap-shot of the merged table.
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [177]:
#Verify that there were no mis-matches.
merged.isnull().any()

state/region    False
ages            False
year            False
population      False
state           False
dtype: bool

In [178]:
#Merge the resulting table with the area table.
final = pd.merge(merged, areas, on = 'state', how = 'left')

In [179]:
#View a snap-shot of the final merged table.
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama          52423
1           AL    total  2012   4817528.0  Alabama          52423
2           AL  under18  2010   1130966.0  Alabama          52423
3           AL    total  2010   4785570.0  Alabama          52423
4           AL  under18  2011   1125763.0  Alabama          52423

In [180]:
#Verify that there were no null values in the table.
final.isnull().any()

state/region     False
ages             False
year             False
population       False
state            False
area (sq. mi)    False
dtype: bool

In [181]:
#Retrieve totals for 2010
data2010 = final.query("(year == 2010) & ages == 'total'")

In [183]:
#View a snap-shot of the 2010 data.
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama          52423
91            AK  total  2010    713868.0      Alaska         656425
101           AZ  total  2010   6408790.0     Arizona         114006
189           AR  total  2010   2922280.0    Arkansas          53182
197           CA  total  2010  37333601.0  California         163707

In [184]:
#Make the state column the new index.
data2010.set_index('state', inplace = True)

In [185]:
#Calculate the population per square mile for each index/state.
density = data2010['population'] / data2010['area (sq. mi)']

In [190]:
#Sort states based on density in descending order.
density.sort_values(ascending = False, inplace = True)

In [191]:
#View a snap-shot of the density data.
density.head()

state
New Jersey       1009.253268
Rhode Island      681.339159
Connecticut       645.600649
Massachusetts     621.815538
Maryland          466.445797
dtype: float64

In [192]:
#View a snap-shot of the least-dense states.
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64